       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.

       DATA DIVISION.
       01 WS-EMP-ID PIC 9(6) VALUE ZERO.
       01 WS-EMP-NAME PIC X(45) VALUE SPACES.
       01 WS-EMP-DEPT-CODE PIC X(3) VALUE SPACES.
       01 WS EMP-JOB-GRADE PIC 9  VALUE ZERO.
       01 WS-EMP-BASIC-SALARY PIC 9(6)V99  VALUE ZERO.

       01 WS-NHIF-DEDUCTION PIC 9(5)V99 VALUE ZERO.
       01 WS-PAYE-DEDUCTION PIC 9(5)V99 VALUE ZERO.
       01 WS-NET-PAY PIC 9(6)V99 VALUE ZERO.

       01 WS-EMPLOYEE-COUNT PIC9(6) VALUE ZERO.
       01 WS-ERROR-COUNT PIC 9(4) VALUE ZERO.

       01 WS-TOTAL-SALARY PIC 9(12)V99  VALUE ZERO.
       01 WS-TOTAL-NHIF  PIC (12)V99  VALUE ZERO.
       01 WS-NET-PAY  PIC 9(12)V99  VALUE ZERO.

       01 WS-EOF-FLAG           PIC X           VALUE 'N'.
       01 WS-ERROR-FLAG         PIC X           VALUE 'N'.

       01 WS-SALARY-DISPLAY     PIC ZZZ,ZZ9.99  VALUE ZERO.
       01 WS-NET-PAY-DISPLAY    PIC ZZZ,ZZ9.99  VALUE ZERO.
       01 WS-SEPARATOR          PIC X(50)       VALUE ALL '='.
        
       
      