       
       
       01 WS-EMPLOYEE-RECORD.
           05 WS-EMP-ID         PIC 999 VALUE 01.
           05 WS-EMP-NAME       PIC X(20) VALUE 'felix juma'.
           05 WS-DEP-CODE       PIC X(4) VALUE  'D001'.

       