        IDENTIFICATION DIVISION.
        PROGRAM-ID. HOSPITAL-RECORD.

        DATA DIVISION. 
        WORKING-STORAGE SECTION.
        01 WS-PATIENT-ID         PIC 9(6)  VALUE ZERO.
        01 WS-FULL-NAME          PIC X(45)  VALUE SPACES.
        01  WS-AGE               PIC 9(3)   VALUE ZERO.
        01 WS-WORLD-CODE         PIC X(3)   VALUE SPACES.
        01 WS-DIAGNOSIS-CODE     PIC X(10)   VALUE SPACES.
        01 WS-TEST-RESULT-1      PIC 9(3)V99    VALUE ZERO.
        01 WS-TEST-RESULT-2      PIC 9(3)V99    VALUE ZERO.
        01 WS-TEST-RESULT-3      PIC 9(3)V99    VALUE ZERO.
        01 WS-ATTENDING-DOCTOR   PIC X(30)   VALUE SPACES.
        01 WS-DISPLAY-TEST-RESULT-1 PIC ZZZ,ZZ9.99 VALUE ZERO.
        01 WS-DISPLAY-TEST-RESULT-2 PIC ZZZ,ZZ9.99 VALUE ZERO.
        01 WS-DISPLAY-TEST-RESULT-3 PIC ZZZ,ZZ9.99 VALUE ZERO.
        01 WS-SEPERATOR          PIC X(40)   VALUE ALL "=".

        PROCEDURE DIVISION.
           STOP RUN.
