       IDENTIFICATION DIVISION.
       PROGRAM-ID. VALIDATE.

       DATA DIVISION. 
       WORKING-STORAGE SECTION.
       01 WS-AGE          PIC 9(3) VALUE 25.
       01 WS-VALID-FLAG   PIC X.
       PROCEDURE DIVISION.
           CALL 'VALIDATE-AGE' USING BY REFERENCE WS-AGE,WS-VALID-FLAG
           DISPLAY 'AFTER CALL:WS-AGE= 'WS-AGE'W S-VALID-FLAG ='
           WS-VALID-FLAG
           STOP RUN.
           