       IDENTIFICATION DIVISION. 
       PROGRAM-ID.SALES.

       ENVIRONMENT DIVISION. 
       INPUT-OUTPUT SECTION. 
       FILE-CONTROL. 
           SELECT REPORT-FILE ASSIGN TO 'SALES.PRT'
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION. 
       FILE SECTION. 
       FD REPORT-FILE
           LINAGE IS 30 LINES WITH FOOTING AT 27
           LINES AT TOP 2 LINES AT BOTTOM 1.
       01 REPORT-LINE        PIC X(123).

       WORKING-STORAGE SECTION. 
       01 WS-PAGE-NUM        PIC 9(3) VALUE ZERO.
       01 WS-LINE            PIC X(132).
       01 WS-PAGE-TOTAL      PIC 9(3).


       PROCEDURE DIVISION .
       MAIN-LOGIC.
           OPEN OUTPUT  REPORT-FILE.
           PERFORM PRINT-PAGE-HEADER
           PERFORM WRITE-DETAIL-LINES
           CLOSE REPORT-FILE 
           STOP RUN.

       WRITE-DETAIL-LINES.
       
           WRITE REPORT-LINE FROM WS-LINE
              AT END-OF-PAGE
                  PERFORM PRINT-PAGE-FOOTER 
                  PERFORM PRINT-PAGE-HEADER 
           END-WRITE.
           
 

       PRINT-PAGE-HEADER.
           ADD 1 TO WS-PAGE-NUM 
           STRING 'SALES REPORT' DELIMITED BY SIZE' PAGE: '
           DELIMITED BY SIZE
              WS-PAGE-NUM DELIMITED BY SIZE INTO WS-LINE

           WRITE REPORT-LINE FROM WS-LINE.

       PRINT-PAGE-FOOTER.
           STRING 'PAGE TOTAL: ' DELIMITED BY SIZE
                 WS-PAGE-TOTAL DELIMITED BY SIZE
                 INTO WS-LINE 

           WRITE REPORT-LINE FROM WS-LINE
              BEFORE ADVANCING 1 LINE
           MOVE ZERO TO WS-PAGE-TOTAL.
           

     

