       IDENTIFICATION DIVISION. 
       PROGRAM-ID.REGIONAL.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION. 
       FILE-CONTROL. 

           SELECT NAIROBI-FILE ASSIGN TO 'NAIROBI.DAT'
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT MOMBASA-FILE ASSIGN TO 'MOMBASA.DAT'
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT NATIONAL-FILE ASSIGN TO 'NATIONAL.DAT'
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT MERGE-WORK ASSIGN TO 'MERGEWORK.TMP'.

       DATA DIVISION. 
       FILE SECTION. 
       SD MERGE-WORK.
       01 MERGE-RECORD.
           05 MR-ACCT     PIC X(8).
           05 MR-NAME     PIC X(20).
           05 MR-AMOUNT   PIC 9(9)V99.

       FD NAIROBI-FILE.
       01 NAIROBI-RECORD     PIC X(30).

       FD MOMBASA-FILE.
       01 MOMBASA-RECORD     PIC X(30).

       FD NATIONAL-FILE.
       01 NATIONAL-RECORD    PIC X(30).

       PROCEDURE DIVISION .
           MERGE MERGE-WORK 
              ON ASCENDING KEY  MR-ACCT 
              USING NAIROBI-FILE , MOMBASA-FILE 
              GIVING NATIONAL-FILE 
           STOP RUN.
